## Plan Result (sbox-01-network)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.target_to_initiator
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.target_to_initiator
* Delete
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.initiator-To-target
  * module.vnet_peer_hub_sbox[&#34;ukSouth&#34;].azurerm_virtual_network_peering.target-To-initiator
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.initiator-To-target
  * module.vnet_peer_hub_sbox[&#34;ukWest&#34;].azurerm_virtual_network_peering.target-To-initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.initiator-To-target will be destroyed
  # (because azurerm_virtual_network_peering.initiator-To-target is not in configuration)
  - resource "azurerm_virtual_network_peering" "initiator-To-target" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/virtualNetworkPeerings/hubUkS" -> null
      - name                         = "hubUkS" -> null
      - remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int" -> null
      - resource_group_name          = "ss-sbox-network-rg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "ss-sbox-vnet" -> null
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hubUkS"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name          = "ss-sbox-network-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ss-sbox-vnet"
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.target-To-initiator will be destroyed
  # (because azurerm_virtual_network_peering.target-To-initiator is not in configuration)
  - resource "azurerm_virtual_network_peering" "target-To-initiator" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int/virtualNetworkPeerings/sssbox" -> null
      - name                         = "sssbox" -> null
      - remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet" -> null
      - resource_group_name          = "hmcts-hub-sbox-int" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "hmcts-hub-sbox-int" -> null
    }

  # module.vnet_peer_hub_sbox["ukSouth"].azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "sssbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + resource_group_name          = "hmcts-hub-sbox-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "hmcts-hub-sbox-int"
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.initiator-To-target will be destroyed
  # (because azurerm_virtual_network_peering.initiator-To-target is not in configuration)
  - resource "azurerm_virtual_network_peering" "initiator-To-target" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/virtualNetworkPeerings/hubUkW" -> null
      - name                         = "hubUkW" -> null
      - remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/ukw-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/ukw-hub-sbox-int" -> null
      - resource_group_name          = "ss-sbox-network-rg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "ss-sbox-vnet" -> null
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hubUkW"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/ukw-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/ukw-hub-sbox-int"
      + resource_group_name          = "ss-sbox-network-rg"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ss-sbox-vnet"
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.target-To-initiator will be destroyed
  # (because azurerm_virtual_network_peering.target-To-initiator is not in configuration)
  - resource "azurerm_virtual_network_peering" "target-To-initiator" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/ukw-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/ukw-hub-sbox-int/virtualNetworkPeerings/sssbox" -> null
      - name                         = "sssbox" -> null
      - remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet" -> null
      - resource_group_name          = "ukw-hub-sbox-int" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "ukw-hub-sbox-int" -> null
    }

  # module.vnet_peer_hub_sbox["ukWest"].azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "sssbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet"
      + resource_group_name          = "ukw-hub-sbox-int"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "ukw-hub-sbox-int"
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":434,"Program":"tfcmt","SHA1":"","Target":"sbox-01-network","Vars":{}} -->